In [1]:
import pandas as pd
import numpy as np

In [8]:
data = {'X': [1, 2, 3, 4], 'Y': [5, 6, 7, 8]}
df = pd.DataFrame(data)
print(df)

   X  Y
0  1  5
1  2  6
2  3  7
3  4  8

In [9]:
df.head(3)

   X  Y
0  1  5
1  2  6
2  3  7

In [10]:
df['X']

0    1
1    2
2    3
3    4
Name: X, dtype: int64

In [12]:
filtered_df = df[df['X'] > 2]
filtered_df

   X  Y
2  3  7
3  4  8

In [13]:
df['Z'] = df['X'] + df['Y']
df

   X  Y   Z
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [15]:
df.drop(columns=['Z'], inplace=True)
df

   X  Y
0  1  5
1  2  6
2  3  7
3  4  8

In [17]:
data = {'X': [4, 3, 2, 1], 'Y': [8, 7, 6, 5]}
df = pd.DataFrame(data)
df.sort_values(by='X', inplace=True)
print(df)

   X  Y
3  1  5
2  2  6
1  3  7
0  4  8

In [18]:
data = {'X': [1, 2, 1, 2], 'Y': [5, 6, 7, 8]}
df = pd.DataFrame(data)
grouped_df = df.groupby('X').mean()
print(grouped_df)

     Y
X
1  6.0
2  7.0

In [19]:
data = {'X': [1, 2, None, 4], 'Y': [5, None, 7, 8]}
df = pd.DataFrame(data)
df.fillna(0, inplace=True)
print(df)

     X    Y
0  1.0  5.0
1  2.0  0.0
2  0.0  7.0
3  4.0  8.0

In [20]:
data = {'X': ['2020-01-01', '2020-01-02', '2020-01-03']}
df = pd.DataFrame(data)
df['X'] = pd.to_datetime(df['X'])
print(df)

           X
0 2020-01-01
1 2020-01-02
2 2020-01-03